src/cf/DataProcessors/ToDoList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ToDoList</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>List</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/InjectionHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>InjectionHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Disease</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CoreDiseases</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NextVaccination</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VaccineLabel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Vaccines</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/LouseDogTreatment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>LouseDogTreatment</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/HealthStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>HealthStatuses</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsCured</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Purposes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Disease</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CoreDiseases</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/HotelBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>HotelBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/SpaBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>SpaBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SpaRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SpaServices</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/DayCare.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>DayCare</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DogSize</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogSizes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Staff</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Package</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Packages</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PackageTime</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PackageTimes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Pickup</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>District</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ward</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Street</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AddressNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PickupTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckIn</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckOut</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Driver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Drivers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ToDoList/Forms/Form/Ext/Form/Module.bsl
#Region Yennn 
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Object.Date =  CurrentDate();
	RunToDoList();
EndProcedure

Procedure RunToDoList()
	GetDataInjection();
	GetDataLouseDogTreatment();
	GetDataHealStatus();
	GetDataHoltelBooking();
	GetDataSpaBooking();
	GetDataDayCare();
	
	Object.List.Sort("Time Asc");
	
EndProcedure

Procedure GetDataInjection()
	
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;	
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	InjectionHistory.Dog AS Dog,
		|	InjectionHistory.Owner AS Owner,
		|	InjectionHistory.Veterinarian AS Veterinarian,
		|	InjectionHistory.Date AS Date
		|FROM
		|	InformationRegister.InjectionHistory AS InjectionHistory
		|WHERE
		|	InjectionHistory.Date BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
		|	AND CASE
		|			WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
		|				THEN TRUE
		|			ELSE InjectionHistory.Veterinarian = &Veterinarian
		|		END";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue", Undefined);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.Date;
		NewLine.Work ="Injection";
		NewLine.Veterinarian = Selection.Veterinarian;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.Owner;
	EndDo;
	
EndProcedure

Procedure GetDataLouseDogTreatment()
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	LouseDogTreatment.Dog AS Dog,
	|	LouseDogTreatment.Owner AS Owner,
	|	LouseDogTreatment.Veterinarian AS Veterinarian,
	|	LouseDogTreatment.Date AS Date
	|FROM
	|	InformationRegister.LouseDogTreatment AS LouseDogTreatment
	|WHERE
	|	LouseDogTreatment.Date BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
	|	AND CASE
	|			WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
	|				THEN TRUE
	|			ELSE LouseDogTreatment.Veterinarian = &Veterinarian
	|		END";
	
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue", Undefined);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.Date;
		NewLine.Work ="Louse dog treatment";
		NewLine.Veterinarian = Selection.Veterinarian;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.Owner;

	EndDo;

	
EndProcedure

Procedure GetDataHealStatus()
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;	
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	HealthStatuses.Dog AS Dog,
	|	HealthStatuses.Owner AS Owner,
	|	HealthStatuses.Veterinarian AS Veterinarian,
	|	HealthStatuses.StartTime AS StartTime
	|FROM
	|	InformationRegister.HealthStatuses AS HealthStatuses
	|WHERE
	|	HealthStatuses.StartTime BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
	|	AND CASE
	|		WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
	|				THEN TRUE
	|			ELSE HealthStatuses.Veterinarian = &Veterinarian
	|		END";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue", Undefined);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.StartTime;
		NewLine.Work ="Dog health care";
		NewLine.Veterinarian = Selection.Veterinarian;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.Owner;
		
	EndDo;
	
EndProcedure

Procedure GetDataHoltelBooking()
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	HotelBookingHistory.Dog AS Dog,
	|	HotelBookingHistory.DogOwner AS DogOwner,
	|	HotelBookingHistory.Veterinarian AS Veterinarian,
	|	HotelBookingHistory.StartTime AS StartTime
	|FROM
	|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
	|WHERE
	|	HotelBookingHistory.StartTime BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
	|	AND CASE
	|			WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
	|				THEN TRUE
	|			ELSE HotelBookingHistory.Veterinarian = &Veterinarian
	|		END";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue",Undefined);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.StartTime;
		NewLine.Work ="Hotel service";
		NewLine.Veterinarian = Selection.Veterinarian;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.DogOwner;
	EndDo;
		
EndProcedure

Procedure GetDataSpaBooking()
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	SpaBookingHistory.Dog AS Dog,
	|	SpaBookingHistory.DogOwner AS DogOwner,
	|	SpaBookingHistory.Veterinarian AS Veterinarian,
	|	SpaBookingHistory.StartTime AS StartTime
	|FROM
	|	InformationRegister.SpaBookingHistory AS SpaBookingHistory
	|WHERE
	|	SpaBookingHistory.StartTime BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
	|	AND CASE
	|			WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
	|				THEN TRUE
	|			ELSE SpaBookingHistory.Veterinarian = &Veterinarian
	|		END";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue",Undefined);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.StartTime;
		NewLine.Work ="Spa service";
		NewLine.Veterinarian = Selection.Veterinarian;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.DogOwner;
		
	EndDo;
	
EndProcedure

Procedure GetDataDayCare()
	Date = Object.Date;
	Veterinarian = Object.Veterinarian;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DayCare.Dog AS Dog,
	|	DayCare.Customer AS Customer,
	|	DayCare.Staff AS Staff,
	|	DayCare.Period AS Period
	|FROM
	|	InformationRegister.DayCare AS DayCare
	|WHERE
	|	DayCare.Period BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)
	|	AND CASE
	|			WHEN &Veterinarian = &EmptyValue OR &Veterinarian = &EmptyRefVer OR &Veterinarian = &EmptyRefEmployee
	|				THEN TRUE
	|			ELSE DayCare.Staff = &Veterinarian
	|		END";

	Query.SetParameter("Date", Date);
	Query.SetParameter("EmptyRefVer", Catalogs.Veterinarians.EmptyRef());
	Query.SetParameter("EmptyRefEmployee", Catalogs.Employees.EmptyRef());
	Query.SetParameter("Veterinarian", Veterinarian);
	Query.SetParameter("EmptyValue",Undefined);

	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		NewLine = Object.List.Add();
		NewLine.Time = Selection.Period;
		NewLine.Work ="Day Care Service";
		NewLine.Veterinarian = Selection.Staff;
		NewLine.Dog = Selection.Dog;
		NewLine.Owner = Selection.Customer;
	EndDo;
	
	//}}QUERY_BUILDER_WITH_RESULT_PROCESSING

EndProcedure

&AtClient
Procedure Reload(Command)
	Object.List.Clear();
	RunToDoList();
EndProcedure
#EndRegion
